Repository: KevinsVision/Angular-i18n-Plugin
Catalog: angular-i18n-plugin/src/locale/messages.*.xlf
Languages: es, fr, pt

source: plane image
es: imagen de avión
fr: image d'avion
pt: imagem do avião

source: You're closer to your destination!
es: ¡Estás más cerca de tu destino!

source: Thank you for flying with us and your ticket has been processed.
es: Gracias por volar con nosotros y su boleto ha sido procesado.

source: Cabin
es: Cabina
fr: Cabine
pt: Cabine

source: Miles
es: Millas
fr: Milles
pt: Milhas

source: Date
es: Fecha
pt: Encontro

source: Tax percentage
es: Porcentaje de impuestos
fr: Pourcentage de taxe
pt: Percentual de imposto

source: Amount
es: La suma
fr: Montant
pt: Quantia

source: Total Amount
es: Cantidad total
fr: Montant total
pt: Valor total

source: aa icon
es: icono de aa
fr: icône d'aa
pt: ícone de aa

source: Updated: {receipt.minutesUpdated, plural, =0 {just now} =1 {one minute ago} other {{{receipt.minutesUpdated}} minutes ago}}
es: Actualizado: {receipt.minutesUpdated, plural, =0 {just now} =1 {one minute ago} other {{{receipt.minutesUpdated}} minutes ago}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago}}
es: {VAR_PLURAL, plural, =0 {en este momento} =1 {hace un minuto} other {hace {INTERPOLATION} minutos}}
fr: {VAR_PLURAL, plural, =0 {à l'instant} =1 {il y a une minute} other {il y a {INTERPOLATION} minutes}}
pt: {VAR_PLURAL, plural, =0 {agora mesmo} =1 {um minuto atrás} other {{INTERPOLATION} minutos atrás}}

source: this.title
es: Recibo
fr: Reçu
pt: Recibo

source: Ticket Confirmation
es: Confirmación de entrada
fr: Confirmation de billet
pt: Confirmação de Ingresso

source: You're closer to your destination!
fr: Vous êtes plus près de votre destination !
pt: Você está mais perto do seu destino!

source: Thank you for flying with us. Your ticket is being processed.
fr: Merci de voler avec nous. Votre ticket est en cours de traitement.
pt: Obrigado por voar conosco. Seu ticket está sendo processado.

source: Updated: {counter, plural, =0 {just now} =1 {one minute ago} other {{{counter}} minutes ago}} <br><br><button (click)="changeCounter(-1)">-</button><button (click)="changeCounter(1)">+</button>
pt: Atualizado: {counter, plural, =0 {just now} =1 {one minute ago} other {{{counter}} minutes ago}} <br><br><button (click)="changeCounter(-1)">-</button><button (click)="changeCounter(1)">+</button>

source: Updated: {counter, plural, =0 {just now} =1 {one minute ago} other {{{counter}} minutes ago}} <br><br><button (click)="changeCounter(-1)">-</button><button (click)="changeCounter(1)">+</button>
fr: Mise à jour : {counter, plural, =0 {just now} =1 {one minute ago} other {{{counter}} minutes ago}} <br><br><button (click)="changeCounter(-1)">-</button><button (click)="changeCounter(1)">+</button>
